Examinator/src/InformationRegisters/НастройкиЛичныхСообщенийСУО/НастройкиЛичныхСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЛичныхСообщенийСУО</name>
  <attributes>
    <name>Удалено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/НастройкиЛичныхСообщенийСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ЗаписатьНастройки(Сообщение, ИмяНастройки=Неопределено, ЗначениеНастройки=Неопределено, Пользователь=Неопределено, ТекущаяДата=Неопределено, ОбновитьДанныеВебКабинетаВТранзакции=Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ТекущаяДата = Неопределено Тогда
		ТекущаяДата  = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Запоминаем просмотр сообщения
	
	НаборЗаписей = РегистрыСведений.НастройкиЛичныхСообщенийСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Сообщение.Установить(Сообщение);

	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Пользователь = Пользователь;
		Запись.Сообщение    = Сообщение;
		
	Иначе
		
		Запись = НаборЗаписей[0];
		
	КонецЕсли;
	
	Запись.ДатаПросмотра = ТекущаяДата;
	
	Если ИмяНастройки <> Неопределено Тогда
		Запись[ИмяНастройки] = ЗначениеНастройки;
	КонецЕсли;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОбновитьДанныеВебКабинетаВТранзакции", ОбновитьДанныеВебКабинетаВТранзакции);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбновитьДанныеВебКабинета(Отбор) Экспорт


	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отбор.Найти("Пользователь") = Неопределено Тогда
		Пользователь = Неопределено;
	Иначе
		Пользователь = Отбор.Пользователь.Значение;
	КонецЕсли;
	
	Если Отбор.Найти("Сообщение") = Неопределено Тогда
		Сообщение = Неопределено;
	Иначе
		Сообщение = Отбор.Сообщение.Значение;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиЛичныхСообщенийСУО.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(Сообщение) Тогда
		
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		НаборЗаписей.Отбор.Сообщение.Установить(Сообщение);		
		
	КонецЕсли;
		
	НаборЗаписей.Прочитать();	
	
	Для каждого Запись Из НаборЗаписей Цикл
		Документы.СообщениеСУО.ОбновитьДанныеВебКабинета(Запись.Сообщение, Новый Структура("ОбновитьТолькоПользовательскиеДанные", Истина));
	КонецЦикла;
	
	
КонецПроцедуры

#КонецЕсли
